import {
  ArticleTitle,
  ArticleAfterTitle,
  ArticleText,
} from "../../pages/ArticlePage/ArticlePage.styled";

const Questions = () => {
  return (
    <div>
      <ArticleTitle>Питання, які часто задають про масаж.</ArticleTitle>
      <ArticleText>
        Масаж є однією з найстаріших і найефективніших технік фізіотерапії, що
        сприяє поліпшенню здоров'я та добробуту. Проте, відомості про масаж
        часто є поверхневими та суперечливими. У цій статті ми розглянемо деякі
        з найпоширеніших питань про масаж та надамо вичерпні відповіді.
      </ArticleText>

      <div>
        <ArticleAfterTitle>Як часто потрібно робити масаж?</ArticleAfterTitle>
        <ArticleText>
          Частота проведення масажу залежить від кількох факторів, таких як мета
          масажу, стан вашого здоров'я та особисті вподобання. Для людей, які
          шукають загальний релакс та стрес-розслаблення, один раз на тиждень
          або раз на два тижні може бути досить. У разі, якщо масаж
          використовується як частина фізіотерапії або для поліпшення конкретних
          медичних станів, лікар чи терапевт може рекомендувати більш часті
          сеанси.
        </ArticleText>
      </div>

      <div>
        <ArticleAfterTitle>
          А що з собою потрібно брати на масаж?
        </ArticleAfterTitle>
        <ArticleText>
          Перед відвідуванням сеансу масажу, важливо уточнити вимоги конкретного
          салону або масажиста. Зазвичай вам можуть знадобитися комфортна одяг
          та взуття для пересування до місця проведення масажу, а також можливо,
          зняття вищого одягу, щоб масажист мав доступ до областей тіла, які
          підлягають обробці. Більшість салонів забезпечують все необхідне для
          комфортного проведення масажу, але ви можете взяти з собою власний
          рушник або халат, якщо вам так зручніше.
        </ArticleText>
      </div>

      <div>
        <ArticleAfterTitle>
          Для чого потрібно ходити на масаж?
        </ArticleAfterTitle>
        <ArticleText>
          Масаж має безліч корисних властивостей, і мета його проведення може
          бути різноманітною:
        </ArticleText>
        <ul>
          <li>
            <ArticleText>
              Релаксація та зняття стресу: Масаж допомагає знизити напругу в
              м'язах, покращити кровообіг та вивільнити ендорфіни - гормони
              щастя, що сприяють загальному підвищенню настрою.
            </ArticleText>
          </li>
          <li>
            <ArticleText>
              Поліпшення кровообігу та лімфодренаж: Масаж стимулює кровообіг та
              лімфатичну систему, що допомагає вивести токсини з організму та
              покращує постачання поживних речовин до клітин.
            </ArticleText>
          </li>
          <li>
            <ArticleText>
              Зняття болю та напруги в м'язах: Масаж може допомогти розслабити
              м'язи, покращити їхню гнучкість та зменшити біль, особливо в
              областях, де накопичується напруга.
            </ArticleText>
          </li>
          <li>
            <ArticleText>
              Підтримка загального здоров'я: Масаж може сприяти поліпшенню стану
              шкіри, покращенню травлення та підтримці імунної системи.
            </ArticleText>
          </li>
          <li>
            <ArticleText>
              Відновлення після травм чи операцій: В медичних цілях масаж може
              використовуватися для поліпшення реабілітації після травм,
              операцій чи спортивних навантажень.
            </ArticleText>
          </li>
        </ul>
        <ArticleText>
          Загалом, масаж - це багатогранний інструмент, який може
          використовуватися як для загальної підтримки здоров'я, так і для
          розв'язання конкретних проблем. Перед початком курсу масажу
          рекомендується звернутися до фахівця для консультації та визначення
          оптимального плану дій.
        </ArticleText>
      </div>
    </div>
  );
};

export default Questions;
